[{"id":"1","name":"Duck or Goose and Dressing ","prepared_by":"Tim White ","ingredients":"4 whole ducks or duck breasts (Goose will work with this recipe as well). \r\n2 cans chicken stock or several chicken wings \r\n2 large skillets of thick cornbread \r\n6 slices of white bread \r\n2 cups of sliced celery \r\n2 cups of chopped sweet onions \r\n2 Tbsp butter \r\n6 eggs \r\n2 cans of Campbell\u0092s cream of chicken soup \r\nground sage \r\n2 Tbsp chopped garlic ","preparation":"In a large pot, add salt, pepper, and 1 Tbsp minced garlic to boiling water and chicken stock\u0085add ducks (and chicken wings if not using stock) and cook for several hours until very tender. Remove meat from broth and pull from the bones and separate, leave large chunks of meat\u0085set aside. Set broth aside. Sauté celery and onion in butter until tender. In a very large bowl, crumble cornbread and white bread, add celery and onions, beaten eggs, and cream of chicken soup\u0085stir thoroughly. Next add broth while stirring until it reaches the consistency of a thin oatmeal (a little bit soupy,) several cups, (more or less) will be required. (This is a judgement call here, you want your dressing to start out soupy because it dries out and firms up as it cooks\u0085you don\u0092t want dry dressing!) Add sage (2 to several TBSP depending on how much you like sage), salt, and pepper to taste. Fold in duck or chicken meat. Pour into a large, buttered casserole dish or several small ones and bake at 400 until brown and bubbly (about 20-30 minutes). Don\u0092t overcook or the dressing will be too dry!. \r\nServes about 10 \u0096 15 people with fixins. "},{"id":"2","name":"Tim\u0092s Secret Duck and Goose Marinade ","prepared_by":"Tim White ","ingredients":"1\/3 cup Olive Oil \r\n1\/2 cup Soy Sauce \r\n1 cup Brown Sugar \r\n1 tsp Chinese 5-Spice (you can get this in the asian food section or the spice section of \r\nmost grocery stores) \r\n1tsp cayenne pepper (more if you like it hot) \r\n2 Tbsp Lee and Perrins Worcestershire \r\nBlack pepper ","preparation":"Have you ever eaten duck or goose and thought it tasted like liver? Or just didn\u0092t like the flavor? You probably had duck or goose that was cooked well done. Wild ducks and geese don\u0092t carry salmonella and the other diseases that livestock and poultry can have. In fact, wild waterfowl are best eaten rare, or medium-rare. The liver-flavor is a result of over cooking. If you cannot stand to eat them medium-rare, then I suggest you make duck and dressing. Try this recipe and be sure not to over-cook your birds\u0085it might be the best duck or goose you ever ate. \r\n1\/3 cup Olive Oil \r\n1\/2 cup Soy Sauce \r\n1 cup Brown Sugar \r\n1 tsp Chinese 5-Spice (you can get this in the asian food section or the spice section of \r\nmost grocery stores) \r\n1tsp cayenne pepper (more if you like it hot) \r\n2 Tbsp Lee and Perrins Worcestershire \r\nBlack pepper \r\nCut meat into 1-inch chunks or leave whole \r\nMarinade duck or goose breast for at least 1 hour, preferably overnight. \r\nGrill ducks on a hot grill for about 4 minutes on each side\u0085serve medium or medium-rare. \r\nGrill whole goose breasts for 6-8 minutes per side and serve medium or medium-rare. "},{"id":"3","name":"Little Game Gumbo ","prepared_by":"Scott Leysath ","ingredients":"1 chicken (2 1\/2 to 3 pound), quartered 2 \u0096 3 rabbits, squirrels, raccoons or game birds, quartered 1 onion, quartered 3 celery stalks, chopped 2 carrots, chopped 8 whole garlic cloves 1 quart dry white wine *** water 1 cup celery, diced 1 cup onion, diced 1 cup carrots, diced 1 cup bell pepper, diced 1 pound spicy sausage, cut into 1\/2 inch slices 1\/4 cup vegetable oil 1\/2 cup all-purpose flour 1\/2 teaspoon cayenne pepper 1\/2 cup diced tomato salt and pepper \r\nwarm cooked white rice ","preparation":"If you have a freezer with a mixed bag of squirrels, rabbits, raccoons and the like, this recipe\u0092s for you. \r\napproximately 3 quarts \r\n1 chicken (2 1\/2 to 3 pound), quartered 2 \u0096 3 rabbits, squirrels, raccoons or game birds, quartered 1 onion, quartered 3 celery stalks, chopped 2 carrots, chopped 8 whole garlic cloves 1 quart dry white wine *** water 1 cup celery, diced 1 cup onion, diced 1 cup carrots, diced 1 cup bell pepper, diced 1 pound spicy sausage, cut into 1\/2 inch slices 1\/4 cup vegetable oil 1\/2 cup all-purpose flour 1\/2 teaspoon cayenne pepper 1\/2 cup diced tomato salt and pepper \r\nwarm cooked white rice \r\nPlace first 6 ingredients in a roasting pan. Spray contents with pan spray and place roasting pan in a preheated 400 degree oven for 30 minutes or until evenly browned. Transfer contents to a large stock pot, add wine and enough water to just barely cover contents. Bring to a boil, reduce heat and simmer, covered, until meat falls easily from bones; about 1 to 1 1\/2 hours. Pour liquid through a strainer or colander into another pot. Remove meat from strainer and reserve. Discard bones and cooked vegetables. Allow broth to cool and skim fat from top. Return broth and cooked meat to pot. Add diced celery, onion, carrots and bell pepper and bring to a boil over medium-high heat. Reduce heat and simmer, uncovered, for 15 minutes. \r\nMeanwhile, brown sausage in a large skillet over medium-high heat. When just-cooked, add vegetable oil and heat. Stir in flour continuously until roux is medium-brown. Add roux\/sausage mixture to stock and add cayenne pepper and tomato. Season with salt and pepper. Heat until liquid thickens. To serve, place a portion of cooked rice on plate or bowl and spoon gumbo over. "},{"id":"4","name":"Braised Rabbit With Pears","prepared_by":"Scott Leysath ","ingredients":"2 young rabbits, each cut into 6 to 8 pieces salt and freshly ground pepper 1\/2 cup all-purpose flour 3 tablespoons olive oil 1 medium onion, finely diced 3 cups dry red wine 1 cup chicken broth 2 tablespoons balsamic vinegar 1 tablespoon brown sugar 2 bay leaves 2 sprigs fresh rosemary 1\/2 teaspoon salt 2 firm, slightly not-quite-ripe pears; skin removed, cored and halved 3 tablespoons chilled butter \r\nSeason rabbit pieces and dust lightly with flour. Heat oil in a large skillet over medium-high heat. Add onion and sauté for 3 \u0096 4 minutes.","preparation":"In most parts of the country, rabbits don\u0092t enjoy the popularity of other mainstream game animals. Big game, upland birds and waterfowl seem to be to quarry of choice for most American hunters. I suppose that doesn\u0092t upset the rabbits all that much. I suspect they would rather hang out with their buddies than in your oven. \r\nI\u0092m not quite sure why, but Americans haven\u0092t really caught on to eating rabbits. Cooked properly, they are moist, delicate and meaty. You can substitute rabbit for just about any recipe that calls for chicken. As a rule, young rabbits eat better than older ones. I\u0092ve had the best luck braising cut-up rabbits, usually with some kind of wine. The following recipe is a good example. 4 servings \r\n2 young rabbits, each cut into 6 to 8 pieces salt and freshly ground pepper 1\/2 cup all-purpose flour 3 tablespoons olive oil 1 medium onion, finely diced 3 cups dry red wine 1 cup chicken broth 2 tablespoons balsamic vinegar 1 tablespoon brown sugar 2 bay leaves 2 sprigs fresh rosemary 1\/2 teaspoon salt 2 firm, slightly not-quite-ripe pears; skin removed, cored and halved 3 tablespoons chilled butter \r\nSeason rabbit pieces and dust lightly with flour. Heat oil in a large skillet over medium-high heat. Add onion and sauté for 3 \u0096 4 minutes. Add rabbit pieces and brown each evenly. Add wine, broth, vinegar, sugar, bay leaves, rosemary and salt. Bring to a boil, then reduce heat to medium-low. Cover and simmer for 30 minutes. Add pears to the pan, cover and simmer for 30 minutes more. Remove rabbit and pears and arrange on plates. Remove bay leaves and rosemary from pan. Whisk in butter until melted and spoon sauce over rabbit. "},{"id":"5","name":"Rabbit With White Beans ","prepared_by":"Scott Leysath ","ingredients":"1 pound white beans, soaked overnight 2 cups carrots, diced 1 large onion, diced 4 ribs celery 3 cloves garlic, minced *** chicken broth 2 young rabbits, cut into pieces 1 pound bacon 1 cup tomato puree salt and pepper ","preparation":"This is a simplified version of the classic French dish, cassoulet. Do remember to wear rubber gloves and wash your hands thoroughly after handling rabbit to avoid exposure to tularemia, a disease carried by most wild rabbits. You can speed this dish up even more by substituting canned cooked white beans for dried, but the texture and flavor of the finished dish won\u0092t be quite the same. 6-8 servings. \r\n1 pound white beans, soaked overnight 2 cups carrots, diced 1 large onion, diced 4 ribs celery 3 cloves garlic, minced *** chicken broth 2 young rabbits, cut into pieces 1 pound bacon 1 cup tomato puree salt and pepper \r\nPlace white beans, carrots, onion, celery and garlic in a large oven-safe pot or Dutch oven. Add chicken broth to one-inch over beans and vegetables. Bring to a boil, then reduce heat and simmer for about one hour or until beans are softened, but not cooked completely. Fry the bacon until done in a large skillet. Remove bacon and break or cut into bite-sized pieces. Fry rabbit pieces in bacon until browned. Add browned rabbit, bacon and tomato puree to pot. Season with salt and pepper. Cover and bake for 1 1\/2 hours at 350 degrees. Check occasionally to make sure that the liquid has not cooked out. Add a little additional chicken broth or water if necessary. "},{"id":"6","name":"Squirrel and Dumplings ","prepared_by":"Tim White ","ingredients":"Stock 6 squirrels \r\n1 medium onion\u0097chopped \r\n3 stalks of celery\u0097chopped \r\n3 carrots\u0097chopped \r\n1 tsp of minced garlic \r\n1 Tbsp. salt \r\n1 Tbsp. pepper \r\nBoil ingredients for up to 2 hours until squirrel meat is very tender. Remove squirrel into a bowl and strain broth. Discard vegetables strained from the broth. Set broth aside. \r\nDumplings \r\n1 ½ cups plain flour \r\n½ cup self-rising flour \r\n¾ cup shortening \r\nbuttermilk ","preparation":"In a large mixing bowl, cut shortening into flour with a pastry cutter, a fork or by hand. Add about ½ cup buttermilk and mix by hand. Continue to add buttermilk until dough begins to form a stiff ball. Dump dough onto a floured surface and kneed slightly. Roll out dough to about ¼ inch thickness. Cut dumplings into strips or circles and drop into boiling broth. Drop about 10 dumplings in at a time and cook for about 1 minute until done. Remove dumplings into a bowl. Continue to add dumplings, cook and remove. \r\nAssembling Squirrel and Dumplings \r\nOnce the dumplings are done there are several ways to finish this dish. Add squirrel meat and dumplings back to hot broth and stir slightly. Serve. Do not stir the dumplings very much after adding them back to the broth or they will disintegrate. "},{"id":"7","name":"Cream of Squirrel Soup ","prepared_by":"Tim White ","ingredients":"6 squirrels\u0097boiled and meat pulled off bones \r\n¼ cup butter \r\n¼ cup of flour \r\n½ tsp minced garlic \r\n½ cup grated mozzarella cheese \r\n2 Tbsp. of cilantro or parsley \r\n2 cups of broth or squirrel stock (chicken stock also works well) \r\n2 cups of Half and Half \r\n1 cup of sliced Portobello mushrooms ","preparation":"Melt butter in skillet over medium heat\u0085add garlic and mushrooms\u0085cook for about 5 minutes\u0085add flour and stir well, cook for about one or two minutes. Add cold broth and bring to a boil stirring constantly\u0085add Half and Half and bring to a boil stirring constantly. Add the squirrel meat, cheese and herbs and continue to cook for about 2 minutes stirring constantly. If soup is too thick, add half and half until it reaches desired consistency. \r\nServe alone, over pasta or over dumplings. "},{"id":"8","name":"Squirrel With Pinto Beans","prepared_by":"Tim White ","ingredients":"6-8 servings \r\n1 pound pinto beans, soaked overnight 1 cup carrots, diced 1 large onion, diced 4 ribs celery 3 cloves garlic, minced chicken broth (or water will work okay) 4 young squirrels, cut into pieces 1 pound bacon 1 cup diced tomatoes \r\nHot sauce to taste (or hot peppers) \r\nCajun seasoning \r\nSalt and pepper ","preparation":"Place beans, carrots, onion, celery and garlic in a large oven-safe pot or Dutch oven. Add chicken broth to one-inch over beans and vegetables. Bring to a boil, then reduce heat and simmer for about one hour or until beans are softened, but not cooked completely. Fry the bacon until done in a large skillet. Remove bacon and break or cut into bite-sized pieces. Rub squirrels with Cajun spices and either grill or smoke until done. Remove meat from the bones and add to pot. Add bacon and tomatoes to pot. Season with salt and pepper. Cover and bake for 1½ hours at 350 degrees. Check occasionally to make sure that the liquid has not cooked out. Add a little additional chicken broth or water if necessary. "},{"id":"9","name":"Bacon-Fried Squirrel ","prepared_by":"Scott Leysath ","ingredients":"4 young squirrels, cut into 8 to 10 pieces 1\/2 teaspoon salt 1\/2 teaspoon freshly ground black pepper 1\/2 teaspoon garlic powder 1\/4 cup all-purpose flour 8 slices bacon, chopped 1\/4 cup onion, sliced 2 celery stalks, sliced 1 tablespoon fresh rosemary leaves, minced 2 teaspoon lemon juice 1 cup chicken broth warm cooked rice ","preparation":"Anything fried tastes pretty good and squirrel is no exception. The squirrel are first fried and then simmered in liquid until tender. Young squirrels taste much better than old ones. If you are worried about fat and cholesterol, eat a carrot. 4 servings \r\n4 young squirrels, cut into 8 to 10 pieces 1\/2 teaspoon salt 1\/2 teaspoon freshly ground black pepper 1\/2 teaspoon garlic powder 1\/4 cup all-purpose flour 8 slices bacon, chopped 1\/4 cup onion, sliced 2 celery stalks, sliced 1 tablespoon fresh rosemary leaves, minced 2 teaspoon lemon juice 1 cup chicken broth warm cooked rice \r\nCombine salt, pepper, garlic powder and flour. Dredge squirrels in flour mixture. Cook bacon in a heavy skillet over medium heat until browned. Fry squirrel pieces in bacon grease until medium brown. Add remaining ingredients and reduce heat to simmer. Cover and cook for about 1 hour or until squirrel pieces are tender. Serve with warm rice. "},{"id":"10","name":"Fried Squirrel","prepared_by":"Tim White ","ingredients":"6 young squirrels \r\n2 egg yolks \r\nflour \r\ngarlic powder \r\nonion powder \r\npaprika \r\nsalt \r\npepper \r\nvegetable oil ","preparation":"Cut squirrels into pieces and wash well. Beat egg yolks and pour over squirrels. Season flour with spices, to taste\u0085add lots of black pepper. Roll squirrel pieces in flour and fry in oil on medium heat. Cover with lid and cook about 5 minutes on each side then remove lid to allow squirrels to brown. \r\nEasy Brown Gravy \r\nLeave about 3 Tablespoons of oil in the skillet\u0085add 3 Tbsp of flour, salt and lots of pepper. Brown flour on medium heat and add about 2 cups of water, turn heat up to high\u0085.let come to a boil and add more water until gravy reaches desired consistency. \r\nOld Squirrels \r\nWhen using old squirrels, which tend to be tough\u0085try this. \r\nAfter frying squirrels as described above, make a very thin and watery brown gravy\u0085..place fried squirrels and gravy in a pressure cooker and pressure cook for 10 minutes. This will tenderize even the oldest of squirrels\u0085 \r\nAnother method for tenderizing old squirrels is to boil them in salt water, with vinegar, garlic, Worcestershire sauce, and bourbon for about 1 hr. Then flour and fry them as described above. Either way makes for some fine eating. \r\nDaddy always liked to fry the squirrel heads and eat the brains\u0085this is one old country tradition that I never took a liking to!!!! "},{"id":"11","name":"Mustard-Fried Venison","prepared_by":"Tim White ","ingredients":"This recipe is my version of a South Carolina low-country favorite. \r\nDeer steaks \u0096 cubed (either beat with a meat hammer or run through a tenderizing machine) \r\nMarinade \r\n¼ cup of buttermilk \r\n½ cup of yellow mustard (spicy mustard, or any other kind will work) \r\n1 tsp Garlic powder \r\n1 Tbsp black pepper \r\n1 tsp cayenne pepper \r\nPinch of salt \r\nBreading \r\n1 cup of flour \r\nPinch of garlic powder \r\n1 tsp cayenne pepper \r\n1 or 2 Tbsp of black pepper \r\nSeveral pinches of salt. ","preparation":"Make sure your deer steaks are trimmed well\u0085.especially trim the white connective tissue, ligaments, and tendons, they are what give the deer a \u0093gamey\u0094 flavor. The buttermilk tenderizes the meat by breaking down this connective tissue\u0085there are other things that can be used to tenderize meat like vinegar, alcoholic beverages, powdered tenderizers and so on, but for this recipe, buttermilk works the best. The buttermilk also gives the batter a good flavor. \r\nMarinade your deer in this mixture for an hour if possible. If you don\u0092t have time or don\u0092t need to tenderize the deer meat, then just use the mustard. Remove the steaks from the marinade and wipe off the excess liquid. The Mustard is the real secret of the recipe. \r\nDredge the steaks in the flour mixture and fry them up on medium heat. Do not cook them on high heat or the mustard will caramelize too quickly and burn before the meat is done. \r\n*A simple version of this recipe is to rub French\u0092s mustard on the steaks, roll them in flour, salt and pepper and then fry them. It tastes almost as good as the fancy recipe above."}]